zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_K566_LPE_GPR1.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K566_K566_LPE_GPR1.h
 * @version 2.2
 * @date 2025-10-16
 * @brief Peripheral Access Layer for S32K566_K566_LPE_GPR1
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K566_K566_LPE_GPR1_H_)  /* Check if memory map has not been already included */
#define S32K566_K566_LPE_GPR1_H_

#include "S32K566_COMMON.h"

/* ----------------------------------------------------------------------------
   -- K566_LPE_GPR1 Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup K566_LPE_GPR1_Peripheral_Access_Layer K566_LPE_GPR1 Peripheral Access Layer
 * @{
 */

/** K566_LPE_GPR1 - Register Layout Typedef */
typedef struct K566_LPE_GPR1_Struct {
  uint8_t RESERVED_0[4096];
  __IO uint32_t GPR_RWD_0;                         /**< Read Write DEST 0, offset: 0x1000 */
  uint8_t RESERVED_1[12];
  __IO uint32_t GPR_RWD_4;                         /**< Read Write DEST 4, offset: 0x1010 */
  __IO uint32_t GPR_RWD_5;                         /**< Read Write DEST 5, offset: 0x1014 */
  __IO uint32_t GPR_RWD_6;                         /**< Read Write DEST 6, offset: 0x1018 */
  uint8_t RESERVED_2[4068];
  __IO uint32_t GPR_RWF_0;                         /**< Read Write FUNC 0, offset: 0x2000 */
  uint8_t RESERVED_3[2044];
  __I  uint32_t GPR_ROF_0;                         /**< Read Only FUNC 0, offset: 0x2800 */
} K566_LPE_GPR1_Type, *K566_LPE_GPR1_MemMapPtr;

/** Number of instances of the K566_LPE_GPR1 module. */
#define K566_LPE_GPR1_INSTANCE_COUNT             (1u)

/* K566_LPE_GPR1 - Peripheral instance base addresses */
/** Peripheral LPE_GPR_1 base address */
#define IP_LPE_GPR_1_BASE                        (0x42044000u)
/** Peripheral LPE_GPR_1 base pointer */
#define IP_LPE_GPR_1                             ((K566_LPE_GPR1_Type *)IP_LPE_GPR_1_BASE)
/** Array initializer of K566_LPE_GPR1 peripheral base addresses */
#define IP_K566_LPE_GPR1_BASE_ADDRS              { IP_LPE_GPR_1_BASE }
/** Array initializer of K566_LPE_GPR1 peripheral base pointers */
#define IP_K566_LPE_GPR1_BASE_PTRS               { IP_LPE_GPR_1 }

/* ----------------------------------------------------------------------------
   -- K566_LPE_GPR1 Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup K566_LPE_GPR1_Register_Masks K566_LPE_GPR1 Register Masks
 * @{
 */

/*! @name GPR_RWD_0 - Read Write DEST 0 */
/*! @{ */

#define K566_LPE_GPR1_GPR_RWD_0_STOP_MODE_ENABLE_MASK (0x1U)
#define K566_LPE_GPR1_GPR_RWD_0_STOP_MODE_ENABLE_SHIFT (0U)
#define K566_LPE_GPR1_GPR_RWD_0_STOP_MODE_ENABLE_WIDTH (1U)
#define K566_LPE_GPR1_GPR_RWD_0_STOP_MODE_ENABLE(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR1_GPR_RWD_0_STOP_MODE_ENABLE_SHIFT)) & K566_LPE_GPR1_GPR_RWD_0_STOP_MODE_ENABLE_MASK)

#define K566_LPE_GPR1_GPR_RWD_0_STOP_MODE_TRIGGER_MASK (0x2U)
#define K566_LPE_GPR1_GPR_RWD_0_STOP_MODE_TRIGGER_SHIFT (1U)
#define K566_LPE_GPR1_GPR_RWD_0_STOP_MODE_TRIGGER_WIDTH (1U)
#define K566_LPE_GPR1_GPR_RWD_0_STOP_MODE_TRIGGER(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR1_GPR_RWD_0_STOP_MODE_TRIGGER_SHIFT)) & K566_LPE_GPR1_GPR_RWD_0_STOP_MODE_TRIGGER_MASK)

#define K566_LPE_GPR1_GPR_RWD_0_CM4_SW_FAULT_MASK (0x4U)
#define K566_LPE_GPR1_GPR_RWD_0_CM4_SW_FAULT_SHIFT (2U)
#define K566_LPE_GPR1_GPR_RWD_0_CM4_SW_FAULT_WIDTH (1U)
#define K566_LPE_GPR1_GPR_RWD_0_CM4_SW_FAULT(x)  (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR1_GPR_RWD_0_CM4_SW_FAULT_SHIFT)) & K566_LPE_GPR1_GPR_RWD_0_CM4_SW_FAULT_MASK)
/*! @} */

/*! @name GPR_RWD_4 - Read Write DEST 4 */
/*! @{ */

#define K566_LPE_GPR1_GPR_RWD_4_FAULT_CH_A_EN0_MASK (0x1U)
#define K566_LPE_GPR1_GPR_RWD_4_FAULT_CH_A_EN0_SHIFT (0U)
#define K566_LPE_GPR1_GPR_RWD_4_FAULT_CH_A_EN0_WIDTH (1U)
#define K566_LPE_GPR1_GPR_RWD_4_FAULT_CH_A_EN0(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR1_GPR_RWD_4_FAULT_CH_A_EN0_SHIFT)) & K566_LPE_GPR1_GPR_RWD_4_FAULT_CH_A_EN0_MASK)

#define K566_LPE_GPR1_GPR_RWD_4_FAULT_CH_A_EN1_MASK (0x2U)
#define K566_LPE_GPR1_GPR_RWD_4_FAULT_CH_A_EN1_SHIFT (1U)
#define K566_LPE_GPR1_GPR_RWD_4_FAULT_CH_A_EN1_WIDTH (1U)
#define K566_LPE_GPR1_GPR_RWD_4_FAULT_CH_A_EN1(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR1_GPR_RWD_4_FAULT_CH_A_EN1_SHIFT)) & K566_LPE_GPR1_GPR_RWD_4_FAULT_CH_A_EN1_MASK)

#define K566_LPE_GPR1_GPR_RWD_4_FAULT_CH_A_EN2_MASK (0x4U)
#define K566_LPE_GPR1_GPR_RWD_4_FAULT_CH_A_EN2_SHIFT (2U)
#define K566_LPE_GPR1_GPR_RWD_4_FAULT_CH_A_EN2_WIDTH (1U)
#define K566_LPE_GPR1_GPR_RWD_4_FAULT_CH_A_EN2(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR1_GPR_RWD_4_FAULT_CH_A_EN2_SHIFT)) & K566_LPE_GPR1_GPR_RWD_4_FAULT_CH_A_EN2_MASK)

#define K566_LPE_GPR1_GPR_RWD_4_FAULT_CH_A_EN3_MASK (0x8U)
#define K566_LPE_GPR1_GPR_RWD_4_FAULT_CH_A_EN3_SHIFT (3U)
#define K566_LPE_GPR1_GPR_RWD_4_FAULT_CH_A_EN3_WIDTH (1U)
#define K566_LPE_GPR1_GPR_RWD_4_FAULT_CH_A_EN3(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR1_GPR_RWD_4_FAULT_CH_A_EN3_SHIFT)) & K566_LPE_GPR1_GPR_RWD_4_FAULT_CH_A_EN3_MASK)

#define K566_LPE_GPR1_GPR_RWD_4_FAULT_CH_A_EN4_MASK (0x10U)
#define K566_LPE_GPR1_GPR_RWD_4_FAULT_CH_A_EN4_SHIFT (4U)
#define K566_LPE_GPR1_GPR_RWD_4_FAULT_CH_A_EN4_WIDTH (1U)
#define K566_LPE_GPR1_GPR_RWD_4_FAULT_CH_A_EN4(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR1_GPR_RWD_4_FAULT_CH_A_EN4_SHIFT)) & K566_LPE_GPR1_GPR_RWD_4_FAULT_CH_A_EN4_MASK)

#define K566_LPE_GPR1_GPR_RWD_4_FAULT_CH_A_EN5_MASK (0x20U)
#define K566_LPE_GPR1_GPR_RWD_4_FAULT_CH_A_EN5_SHIFT (5U)
#define K566_LPE_GPR1_GPR_RWD_4_FAULT_CH_A_EN5_WIDTH (1U)
#define K566_LPE_GPR1_GPR_RWD_4_FAULT_CH_A_EN5(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR1_GPR_RWD_4_FAULT_CH_A_EN5_SHIFT)) & K566_LPE_GPR1_GPR_RWD_4_FAULT_CH_A_EN5_MASK)

