zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_K566_LPE_GPR1.h
#define K566_LPE_GPR1_GPR_RWF_0_LPE_AXBS_FAULT_ACK_MASK (0x4U)
#define K566_LPE_GPR1_GPR_RWF_0_LPE_AXBS_FAULT_ACK_SHIFT (2U)
#define K566_LPE_GPR1_GPR_RWF_0_LPE_AXBS_FAULT_ACK_WIDTH (1U)
#define K566_LPE_GPR1_GPR_RWF_0_LPE_AXBS_FAULT_ACK(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR1_GPR_RWF_0_LPE_AXBS_FAULT_ACK_SHIFT)) & K566_LPE_GPR1_GPR_RWF_0_LPE_AXBS_FAULT_ACK_MASK)

#define K566_LPE_GPR1_GPR_RWF_0_CAN_TS_SEL_MASK  (0x8U)
#define K566_LPE_GPR1_GPR_RWF_0_CAN_TS_SEL_SHIFT (3U)
#define K566_LPE_GPR1_GPR_RWF_0_CAN_TS_SEL_WIDTH (1U)
#define K566_LPE_GPR1_GPR_RWF_0_CAN_TS_SEL(x)    (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR1_GPR_RWF_0_CAN_TS_SEL_SHIFT)) & K566_LPE_GPR1_GPR_RWF_0_CAN_TS_SEL_MASK)

#define K566_LPE_GPR1_GPR_RWF_0_CAN_TS_EN_MASK   (0x10U)
#define K566_LPE_GPR1_GPR_RWF_0_CAN_TS_EN_SHIFT  (4U)
#define K566_LPE_GPR1_GPR_RWF_0_CAN_TS_EN_WIDTH  (1U)
#define K566_LPE_GPR1_GPR_RWF_0_CAN_TS_EN(x)     (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR1_GPR_RWF_0_CAN_TS_EN_SHIFT)) & K566_LPE_GPR1_GPR_RWF_0_CAN_TS_EN_MASK)

#define K566_LPE_GPR1_GPR_RWF_0_FPU_DISABLE_MASK (0x400U)
#define K566_LPE_GPR1_GPR_RWF_0_FPU_DISABLE_SHIFT (10U)
#define K566_LPE_GPR1_GPR_RWF_0_FPU_DISABLE_WIDTH (1U)
#define K566_LPE_GPR1_GPR_RWF_0_FPU_DISABLE(x)   (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR1_GPR_RWF_0_FPU_DISABLE_SHIFT)) & K566_LPE_GPR1_GPR_RWF_0_FPU_DISABLE_MASK)

#define K566_LPE_GPR1_GPR_RWF_0_LPE_LPUART_0_QREQ_CTRL_MASK (0x800U)
#define K566_LPE_GPR1_GPR_RWF_0_LPE_LPUART_0_QREQ_CTRL_SHIFT (11U)
#define K566_LPE_GPR1_GPR_RWF_0_LPE_LPUART_0_QREQ_CTRL_WIDTH (1U)
#define K566_LPE_GPR1_GPR_RWF_0_LPE_LPUART_0_QREQ_CTRL(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR1_GPR_RWF_0_LPE_LPUART_0_QREQ_CTRL_SHIFT)) & K566_LPE_GPR1_GPR_RWF_0_LPE_LPUART_0_QREQ_CTRL_MASK)

#define K566_LPE_GPR1_GPR_RWF_0_LPE_LPUART_1_QREQ_CTRL_MASK (0x1000U)
#define K566_LPE_GPR1_GPR_RWF_0_LPE_LPUART_1_QREQ_CTRL_SHIFT (12U)
#define K566_LPE_GPR1_GPR_RWF_0_LPE_LPUART_1_QREQ_CTRL_WIDTH (1U)
#define K566_LPE_GPR1_GPR_RWF_0_LPE_LPUART_1_QREQ_CTRL(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR1_GPR_RWF_0_LPE_LPUART_1_QREQ_CTRL_SHIFT)) & K566_LPE_GPR1_GPR_RWF_0_LPE_LPUART_1_QREQ_CTRL_MASK)

#define K566_LPE_GPR1_GPR_RWF_0_LPE_LPUART_2_QREQ_CTRL_MASK (0x2000U)
#define K566_LPE_GPR1_GPR_RWF_0_LPE_LPUART_2_QREQ_CTRL_SHIFT (13U)
#define K566_LPE_GPR1_GPR_RWF_0_LPE_LPUART_2_QREQ_CTRL_WIDTH (1U)
#define K566_LPE_GPR1_GPR_RWF_0_LPE_LPUART_2_QREQ_CTRL(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR1_GPR_RWF_0_LPE_LPUART_2_QREQ_CTRL_SHIFT)) & K566_LPE_GPR1_GPR_RWF_0_LPE_LPUART_2_QREQ_CTRL_MASK)

#define K566_LPE_GPR1_GPR_RWF_0_LPE_LPI2C_QREQ_CTRL_MASK (0x4000U)
#define K566_LPE_GPR1_GPR_RWF_0_LPE_LPI2C_QREQ_CTRL_SHIFT (14U)
#define K566_LPE_GPR1_GPR_RWF_0_LPE_LPI2C_QREQ_CTRL_WIDTH (1U)
#define K566_LPE_GPR1_GPR_RWF_0_LPE_LPI2C_QREQ_CTRL(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR1_GPR_RWF_0_LPE_LPI2C_QREQ_CTRL_SHIFT)) & K566_LPE_GPR1_GPR_RWF_0_LPE_LPI2C_QREQ_CTRL_MASK)

#define K566_LPE_GPR1_GPR_RWF_0_LPE_LPSPI_0_QREQ_CTRL_MASK (0x8000U)
#define K566_LPE_GPR1_GPR_RWF_0_LPE_LPSPI_0_QREQ_CTRL_SHIFT (15U)
#define K566_LPE_GPR1_GPR_RWF_0_LPE_LPSPI_0_QREQ_CTRL_WIDTH (1U)
#define K566_LPE_GPR1_GPR_RWF_0_LPE_LPSPI_0_QREQ_CTRL(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR1_GPR_RWF_0_LPE_LPSPI_0_QREQ_CTRL_SHIFT)) & K566_LPE_GPR1_GPR_RWF_0_LPE_LPSPI_0_QREQ_CTRL_MASK)

#define K566_LPE_GPR1_GPR_RWF_0_LPE_LPSPI_1_QREQ_CTRL_MASK (0x10000U)
#define K566_LPE_GPR1_GPR_RWF_0_LPE_LPSPI_1_QREQ_CTRL_SHIFT (16U)
#define K566_LPE_GPR1_GPR_RWF_0_LPE_LPSPI_1_QREQ_CTRL_WIDTH (1U)
#define K566_LPE_GPR1_GPR_RWF_0_LPE_LPSPI_1_QREQ_CTRL(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR1_GPR_RWF_0_LPE_LPSPI_1_QREQ_CTRL_SHIFT)) & K566_LPE_GPR1_GPR_RWF_0_LPE_LPSPI_1_QREQ_CTRL_MASK)

#define K566_LPE_GPR1_GPR_RWF_0_FAULT_0_MUX_SEL_MASK (0x20000U)
#define K566_LPE_GPR1_GPR_RWF_0_FAULT_0_MUX_SEL_SHIFT (17U)
#define K566_LPE_GPR1_GPR_RWF_0_FAULT_0_MUX_SEL_WIDTH (1U)
#define K566_LPE_GPR1_GPR_RWF_0_FAULT_0_MUX_SEL(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR1_GPR_RWF_0_FAULT_0_MUX_SEL_SHIFT)) & K566_LPE_GPR1_GPR_RWF_0_FAULT_0_MUX_SEL_MASK)

#define K566_LPE_GPR1_GPR_RWF_0_FAULT_1_MUX_SEL_MASK (0x40000U)
#define K566_LPE_GPR1_GPR_RWF_0_FAULT_1_MUX_SEL_SHIFT (18U)
#define K566_LPE_GPR1_GPR_RWF_0_FAULT_1_MUX_SEL_WIDTH (1U)
#define K566_LPE_GPR1_GPR_RWF_0_FAULT_1_MUX_SEL(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR1_GPR_RWF_0_FAULT_1_MUX_SEL_SHIFT)) & K566_LPE_GPR1_GPR_RWF_0_FAULT_1_MUX_SEL_MASK)

#define K566_LPE_GPR1_GPR_RWF_0_FAULT_2_MUX_SEL_MASK (0x80000U)
#define K566_LPE_GPR1_GPR_RWF_0_FAULT_2_MUX_SEL_SHIFT (19U)
#define K566_LPE_GPR1_GPR_RWF_0_FAULT_2_MUX_SEL_WIDTH (1U)
#define K566_LPE_GPR1_GPR_RWF_0_FAULT_2_MUX_SEL(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR1_GPR_RWF_0_FAULT_2_MUX_SEL_SHIFT)) & K566_LPE_GPR1_GPR_RWF_0_FAULT_2_MUX_SEL_MASK)

#define K566_LPE_GPR1_GPR_RWF_0_PHA_MUX_SEL_MASK (0x100000U)
#define K566_LPE_GPR1_GPR_RWF_0_PHA_MUX_SEL_SHIFT (20U)
#define K566_LPE_GPR1_GPR_RWF_0_PHA_MUX_SEL_WIDTH (1U)
#define K566_LPE_GPR1_GPR_RWF_0_PHA_MUX_SEL(x)   (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR1_GPR_RWF_0_PHA_MUX_SEL_SHIFT)) & K566_LPE_GPR1_GPR_RWF_0_PHA_MUX_SEL_MASK)

#define K566_LPE_GPR1_GPR_RWF_0_PHB_MUX_SEL_MASK (0x200000U)
#define K566_LPE_GPR1_GPR_RWF_0_PHB_MUX_SEL_SHIFT (21U)
#define K566_LPE_GPR1_GPR_RWF_0_PHB_MUX_SEL_WIDTH (1U)
#define K566_LPE_GPR1_GPR_RWF_0_PHB_MUX_SEL(x)   (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR1_GPR_RWF_0_PHB_MUX_SEL_SHIFT)) & K566_LPE_GPR1_GPR_RWF_0_PHB_MUX_SEL_MASK)
/*! @} */

/*! @name GPR_ROF_0 - Read Only FUNC 0 */
/*! @{ */

#define K566_LPE_GPR1_GPR_ROF_0_LPE_LPUART_0_QACCEPT_STAT_MASK (0x1U)
#define K566_LPE_GPR1_GPR_ROF_0_LPE_LPUART_0_QACCEPT_STAT_SHIFT (0U)
#define K566_LPE_GPR1_GPR_ROF_0_LPE_LPUART_0_QACCEPT_STAT_WIDTH (1U)
#define K566_LPE_GPR1_GPR_ROF_0_LPE_LPUART_0_QACCEPT_STAT(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR1_GPR_ROF_0_LPE_LPUART_0_QACCEPT_STAT_SHIFT)) & K566_LPE_GPR1_GPR_ROF_0_LPE_LPUART_0_QACCEPT_STAT_MASK)

