zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_K566_LPE_GPR1.h
#define K566_LPE_GPR1_GPR_ROF_0_LPE_LPUART_1_QACCEPT_STAT_MASK (0x2U)
#define K566_LPE_GPR1_GPR_ROF_0_LPE_LPUART_1_QACCEPT_STAT_SHIFT (1U)
#define K566_LPE_GPR1_GPR_ROF_0_LPE_LPUART_1_QACCEPT_STAT_WIDTH (1U)
#define K566_LPE_GPR1_GPR_ROF_0_LPE_LPUART_1_QACCEPT_STAT(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR1_GPR_ROF_0_LPE_LPUART_1_QACCEPT_STAT_SHIFT)) & K566_LPE_GPR1_GPR_ROF_0_LPE_LPUART_1_QACCEPT_STAT_MASK)

#define K566_LPE_GPR1_GPR_ROF_0_LPE_LPUART_2_QACCEPT_STAT_MASK (0x4U)
#define K566_LPE_GPR1_GPR_ROF_0_LPE_LPUART_2_QACCEPT_STAT_SHIFT (2U)
#define K566_LPE_GPR1_GPR_ROF_0_LPE_LPUART_2_QACCEPT_STAT_WIDTH (1U)
#define K566_LPE_GPR1_GPR_ROF_0_LPE_LPUART_2_QACCEPT_STAT(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR1_GPR_ROF_0_LPE_LPUART_2_QACCEPT_STAT_SHIFT)) & K566_LPE_GPR1_GPR_ROF_0_LPE_LPUART_2_QACCEPT_STAT_MASK)

#define K566_LPE_GPR1_GPR_ROF_0_LPE_LPSPI_0_QACCEPT_STAT_MASK (0x8U)
#define K566_LPE_GPR1_GPR_ROF_0_LPE_LPSPI_0_QACCEPT_STAT_SHIFT (3U)
#define K566_LPE_GPR1_GPR_ROF_0_LPE_LPSPI_0_QACCEPT_STAT_WIDTH (1U)
#define K566_LPE_GPR1_GPR_ROF_0_LPE_LPSPI_0_QACCEPT_STAT(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR1_GPR_ROF_0_LPE_LPSPI_0_QACCEPT_STAT_SHIFT)) & K566_LPE_GPR1_GPR_ROF_0_LPE_LPSPI_0_QACCEPT_STAT_MASK)

#define K566_LPE_GPR1_GPR_ROF_0_LPE_LPSPI_1_QACCEPT_STAT_MASK (0x10U)
#define K566_LPE_GPR1_GPR_ROF_0_LPE_LPSPI_1_QACCEPT_STAT_SHIFT (4U)
#define K566_LPE_GPR1_GPR_ROF_0_LPE_LPSPI_1_QACCEPT_STAT_WIDTH (1U)
#define K566_LPE_GPR1_GPR_ROF_0_LPE_LPSPI_1_QACCEPT_STAT(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR1_GPR_ROF_0_LPE_LPSPI_1_QACCEPT_STAT_SHIFT)) & K566_LPE_GPR1_GPR_ROF_0_LPE_LPSPI_1_QACCEPT_STAT_MASK)

#define K566_LPE_GPR1_GPR_ROF_0_LPE_LPI2C_QACCEPT_STAT_MASK (0x20U)
#define K566_LPE_GPR1_GPR_ROF_0_LPE_LPI2C_QACCEPT_STAT_SHIFT (5U)
#define K566_LPE_GPR1_GPR_ROF_0_LPE_LPI2C_QACCEPT_STAT_WIDTH (1U)
#define K566_LPE_GPR1_GPR_ROF_0_LPE_LPI2C_QACCEPT_STAT(x) (((uint32_t)(((uint32_t)(x)) << K566_LPE_GPR1_GPR_ROF_0_LPE_LPI2C_QACCEPT_STAT_SHIFT)) & K566_LPE_GPR1_GPR_ROF_0_LPE_LPI2C_QACCEPT_STAT_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group K566_LPE_GPR1_Register_Masks */

/*!
 * @}
 */ /* end of group K566_LPE_GPR1_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K566_K566_LPE_GPR1_H_) */
